app/controllers/api/shows_controller.rb

SELECT `shows`.* FROM `shows` WHERE `shows`.`showdate` = '7/5/19'
SELECT `shows`.* FROM `shows` INNER JOIN `user_shows` ON `shows`.`id` = `user_shows`.`show_id` WHERE `user_shows`.`user_id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
---
  def index
    if params[:showdate]
      @shows = Show.where(showdate: params[:showdate])
    elsif params[:venue]
      @shows = Show.where(venue: params[:venue])
    elsif params[:show_id]
      @shows = Show.find(params[:show_id])
    elsif params[:user_id]
      @shows = User.find(params[:user_id]).shows
      @shows = @shows.sort_by{|show| show.id}
    else
      @shows = Show.all

SELECT  `shows`.* FROM `shows` WHERE `shows`.`id` = 1909 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `user_shows` (`user_id`, `show_id`, `created_at`, `updated_at`) VALUES (1, 1909, '2019-09-19 04:47:47', '2019-09-19 04:47:47')
---
  def create
    if (params[:show_id] && params[:user_id])
      @show = Show.find(params[:show_id])
      @user = User.find(params[:user_id])
      @user.shows << @show

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `shows`.* FROM `shows` WHERE `shows`.`id` = 1920 LIMIT 1
DELETE FROM `user_shows` WHERE `user_shows`.`user_id` = 1 AND `user_shows`.`show_id` = 1920
---
  def destroy
    @user = User.find(params[:user_id])
    @show = Show.find(params[:id])
    @user.shows.delete(@show)