app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
 def authenticate_with_auth_token auth_token
   unless auth_token.include?(':')
     @@message = "no colon error"
     authentication_error
     return
   end

   user_id = auth_token.split(':').first
   user = User.where(id: user_id).first