app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'athena@toymarks.biz' ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    @user = User.find_for_database_authentication(email: params[:username])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def currentuser
    @current_user ||= User.find_by(id: session[:user_id])